uhnp/src/DataProcessors/УправлениеАналогами/УправлениеАналогами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УправлениеАналогами</name>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодЗакупки</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНеМенее</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассA</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассB</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассC</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Субъекты223ФЗ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаАналогов</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>DefinedType.ТипНоменклатураЕХ</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогНоменклатура</name>
      <type>
        <types>DefinedType.ТипНоменклатураЕХ</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогХарактеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>АналогЕдиницаИзмерения</name>
      <type>
        <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьАналоги</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПотребность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПотребность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналогКоличество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналогСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Экономия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ABC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИсходная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭкономияЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>DefinedType.КоэффициентЕдиницыИзмеренияУХ</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/АналогиНоменклатуры/АналогиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АналогиНоменклатуры</name>
  <resources>
    <name>АналогНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>АналогХарактеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>АналогЕдиницаИзмерения</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </resources>
  <resources>
    <name>Коэффициент</name>
    <comment>Если количество в единицах источника умножить на коэффициент, то получим количество в единицах приемника</comment>
    <type>
      <types>DefinedType.КоэффициентЕдиницыИзмеренияУХ</types>
    </type>
  </resources>
  <dimensions>
    <name>ПериодЗакупки</name>
    <type>
      <types>CatalogRef.Периоды</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/НастройкаЗаменыНоменклатурыЗакупок/НастройкаЗаменыНоменклатурыЗакупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкаЗаменыНоменклатурыЗакупок</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Коэффициент</name>
    <comment>Если количество в единицах источника умножить на коэффициент, то получим количество в единицах приемника</comment>
    <type>
      <types>DefinedType.КоэффициентЕдиницыИзмеренияУХ</types>
    </type>
  </resources>
  <dimensions>
    <name>СпособЗамены</name>
    <type>
      <types>EnumRef.СпособыЗаменыНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураИсточник</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаИсточник</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмеренияИсточник</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПриемник</name>
    <type>
      <types>DefinedType.ТипНоменклатураЕХ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПриемник</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмеренияПриемник</name>
    <type>
      <types>DefinedType.ТипЕдиницаИзмеренияЕХ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/Catalogs/ХарактеристикиНоменклатуры/ХарактеристикиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХарактеристикиНоменклатуры</name>
  <owners>Catalog.ВидыНоменклатуры</owners>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Принципал</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КиЗГИСМGTIN</name>
    <type>
      <types>DefinedType.GTIN</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаНоменклатурыДляЦенообразования</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/DataProcessors/УправлениеАналогами/Forms/Форма/Module.bsl
#Область СобытияФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.КлассA = Истина;
	Объект.КлассB = Истина;
	Объект.КлассC = Истина;
	
	Если Параметры.Свойство("Отбор") И ТипЗнч(Параметры.Отбор) = Тип("Структура") Тогда   
		
		Если Параметры.Отбор.Свойство("ПериодЗакупки") Тогда
			ЭтотОбъект.ПериодЗакупки.ДатаНачала 	= Параметры.Отбор.ПериодЗакупки.ДатаНачала;
			ЭтотОбъект.ПериодЗакупки.ДатаОкончания 	= Параметры.Отбор.ПериодЗакупки.ДатаОкончания; 
			ЭтотОбъект.ПериодЗакупки.Вариант 		= ВариантСтандартногоПериода.ПроизвольныйПериод;
		КонецЕсли;  
		
		Параметры.Отбор.Свойство("ПериодСсылка", 	Объект.ПериодЗакупки);
		
		Параметры.Отбор.Свойство("Автор", 			Объект.Пользователь);
		
		Параметры.Отбор.Свойство("Субъекты223", 	ЭтотОбъект.Субъекты223ФЗ);
		Элементы.ПериодПотребностей.ТолькоПросмотр = Истина;    
		Элементы.ПериодЗакупки.ТолькоПросмотр = Истина; 
		Элементы.Пользователь.ТолькоПросмотр = Истина;    
		
		Если Параметры.Отбор.Свойство("РеквизитыОтбора") Тогда     
			Для Каждого РеквизитОтбора Из Параметры.Отбор.РеквизитыОтбора Цикл  
				СтрокаТаблицаОтбора = ЭтотОбъект.ТаблицаПараметровОтбора.Добавить();
				СтрокаТаблицаОтбора.ИмяРеквизита = РеквизитОтбора.Ключ;
				СтрокаТаблицаОтбора.ЗначениеОтбора = РеквизитОтбора.Значение.Значение;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	Если Параметры.Свойство("Отбор") И ТипЗнч(Параметры.Отбор) = Тип("Структура") Тогда
		
		Если Параметры.Отбор.Свойство("Автор") Тогда
			Настройки["Объект.Пользователь"] = Параметры.Отбор.Автор;   
			Объект["Пользователь"] = Параметры.Отбор.Автор; 
		КонецЕсли;
		
		Если Параметры.Отбор.Свойство("ПериодЗакупки") Тогда
			Настройки["Объект.ПериодЗакупки"] = Параметры.Отбор.ПериодСсылка;
			Объект["ПериодЗакупки"] = Параметры.Отбор.ПериодСсылка;
		КонецЕсли;     
		
		Если Параметры.Отбор.Свойство("Субъекты223ФЗ") Тогда
			Настройки["Субъекты223ФЗ"] = Параметры.Отбор.Субъекты223ФЗ;
			ЭтотОбъект["Субъекты223ФЗ"] = Параметры.Отбор.Субъекты223ФЗ;
		КонецЕсли;  
		
	КонецЕсли;
	
	ЗаполнитьДеревоНаСервере(Объект.Пользователь, Объект.ПериодЗакупки); 
	
	ТолькоСАналогами = Истина;   
	
	ОтборТолькоСАналогами();
	
КонецПроцедуры

&НаСервере
Процедура ОтборТолькоСАналогами()
	
	Если ТолькоСАналогами Тогда
		Элементы.ТаблицаАналогов.ОтборСтрок = Новый ФиксированнаяСтруктура("ЕстьАналоги", Истина);   
	Иначе
		Элементы.ТаблицаАналогов.ОтборСтрок = Неопределено;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПодключитьОбработчикОжидания("СформироватьПриОткрытии", 0.1, Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура СформироватьПриОткрытии() Экспорт

	Сформировать(Неопределено);
	
КонецПроцедуры


#КонецОбласти 

&НаКлиенте
Процедура ТаблицаАналоговВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ТаблицаАналоговАналогНоменклатура" Тогда
		ПроизвестиВыборАналога(ВыбраннаяСтрока);
		Сформировать(Неопределено);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьДеревоНаСервере(Пользователь, ПериодЗакупки)
	
	Если НЕ ЗначениеЗаполнено(Пользователь) Тогда
		Объект.ТаблицаАналогов.Очистить();
		Возврат неопределено;
	КонецЕсли;
	
	//Получаем схему из макета
	СхемаКомпоновкиДанных = Отчеты.ОтчетОПримененииАналогов.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	//
	ВариантНастройки = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("ОценкаАналогов");  
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.ЗагрузитьНастройки(ВариантНастройки.Настройки);
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПеренестиПоляВыбораНаВерхнийУровень(Настройки, Настройки.Выбор.Элементы, неопределено);   
	УстановитьОбязательныеПоляПотребностей(Настройки.Выбор);
	
	// Параметры вывода
	Параметр = Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("РасположениеИтогов"));
	Параметр.Значение = РасположениеИтоговКомпоновкиДанных.Нет;
	Параметр.Использование = Истина;
	
	// Параметры данных
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Автор"));
	Параметр.Значение = Пользователь;
	
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодЗакупки")); 
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = Объект.ПериодЗакупки;
		Параметр.Использование = Истина;
	КонецЕсли; 
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИспользуетсяЦенообразование25")); 
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени("Константа.ИспользуетсяЦенообразование25").Получить();
		Параметр.Использование = Истина;
	КонецЕсли;                           
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СтандартныйПериод")); 
	Если Параметр <> Неопределено Тогда
		Параметр.Значение.ДатаНачала 	= ЭтотОбъект.ПериодЗакупки.ДатаНачала;
		Параметр.Значение.ДатаОкончания = ЭтотОбъект.ПериодЗакупки.ДатаОкончания;
		Параметр.Значение.Вариант 		= ВариантСтандартногоПериода.ПроизвольныйПериод;
		Параметр.Использование = Истина;
	КонецЕсли;     
	
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачала"));  
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = ЭтотОбъект.ПериодЗакупки.ДатаНачала; 
		Параметр.Использование = Истина;	
	КонецЕсли;
	Параметр = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОкончания")); 
	Если Параметр <> Неопределено Тогда
		Параметр.Значение = ЭтотОбъект.ПериодЗакупки.ДатаОкончания;
		Параметр.Использование = Истина;
	КонецЕсли;  
	
	РеквизитыОтбора = СтруктураПараметровОтбора();    
	Для Каждого КлючИЗнчение Из РеквизитыОтбора Цикл
		Если СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Поля.Найти(КлючИЗнчение.Ключ) = Неопределено Тогда
			Продолжить;
		КонецЕсли;       
		Если ЗначениеЗаполнено(КлючИЗнчение.Значение.Значение) Тогда  
			ПолеОтбораСубъекты = Новый ПолеКомпоновкиДанных(КлючИЗнчение.Ключ);
			ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
			ЭлементОтбора.ЛевоеЗначение = ПолеОтбораСубъекты;
			ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных[КлючИЗнчение.Значение.ВидСравнения];
			ЭлементОтбора.Использование = Истина; 
			ЭлементОтбора.ПравоеЗначение = КлючИЗнчение.Значение.Значение;
		КонецЕсли;
	КонецЦикла;  
	
	КомпоновщикНастроек.ЗагрузитьНастройки(ВариантНастройки.Настройки);
	
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	//Выводим результат в табличный документ
	Таблица = Новый ДеревоЗначений;     
	ПроцессорВыводаВТЗ = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВыводаВТЗ.УстановитьОбъект(Таблица);
	
	ПроцессорВыводаВТЗ.Вывести(ПроцессорКомпоновкиДанных); 
	
	ЭтотОбъект.ДеревоАналогов.ПолучитьЭлементы().Очистить();
	
	Для Каждого СтрокаДереваТаблицы Из Таблица.Строки Цикл  
		
		СтрокаКорень = ЭтотОбъект.ДеревоАналогов.ПолучитьЭлементы().Добавить();  
		ЗаполнитьЗначенияСвойств(СтрокаКорень, 	СтрокаДереваТаблицы);   
		СтрокаКорень.ABC = "";
		
		ЗаполнитьСтрокуДерева(СтрокаДереваТаблицы, СтрокаКорень);  
		СтрокаКорень.КоличествоПотребность = 0; 
		СтрокаКорень.АналогКоличество = 0;

		//
		Для Каждого ДетальнаяЗапись Из СтрокаДереваТаблицы.Строки Цикл 
			СтрокаДетальнаяЗапись = СтрокаКорень.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДетальнаяЗапись, ДетальнаяЗапись);
			ЗаполнитьСтрокуДерева(ДетальнаяЗапись, СтрокаДетальнаяЗапись);   
			
			Если Не ЭтотОбъект.Объект.КлассA Тогда
				Если СтрокаДетальнаяЗапись.ABC = "A" Тогда 
					СтрокаКорень.ПолучитьЭлементы().Удалить(СтрокаДетальнаяЗапись);
					Продолжить;
				КонецЕсли;	
			КонецЕсли;     
			Если Не ЭтотОбъект.Объект.КлассB Тогда
				Если СтрокаДетальнаяЗапись.ABC = "B" Тогда 
					СтрокаКорень.ПолучитьЭлементы().Удалить(СтрокаДетальнаяЗапись);
					Продолжить;
				КонецЕсли;	
			КонецЕсли;  
			Если Не ЭтотОбъект.Объект.КлассC Тогда
				Если СтрокаДетальнаяЗапись.ABC = "C" Тогда 
					СтрокаКорень.ПолучитьЭлементы().Удалить(СтрокаДетальнаяЗапись);
					Продолжить;
				КонецЕсли;	
			КонецЕсли; 
			
			Если Объект.СуммаНеМенее > 0 И СтрокаДетальнаяЗапись.СуммаПотребность < Объект.СуммаНеМенее Тогда
				СтрокаКорень.ПолучитьЭлементы().Удалить(СтрокаДетальнаяЗапись); 
				Продолжить;
			КонецЕсли;  
			
			Если ЭтотОбъект.ТолькоСАналогами Тогда
				Если Не СтрокаДетальнаяЗапись.ЕстьАналоги Тогда 
					СтрокаКорень.ПолучитьЭлементы().Удалить(СтрокаДетальнаяЗапись);
					Продолжить;
				КонецЕсли;
			КонецЕсли;  
			
			Если ЭтотОбъект.ТолькоСЭкономией Тогда
				Если СтрокаДетальнаяЗапись.Экономия <= 0  Тогда 
					СтрокаКорень.ПолучитьЭлементы().Удалить(СтрокаДетальнаяЗапись);
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			СтрокаДетальнаяЗапись.ЭтоКорень = Ложь;
			
			СтрокаКорень.СуммаПотребность 	= СтрокаКорень.СуммаПотребность + СтрокаДетальнаяЗапись.СуммаПотребность; 
			СтрокаКорень.КоличествоПотребность 	= СтрокаКорень.КоличествоПотребность + СтрокаДетальнаяЗапись.КоличествоПотребность; 
			СтрокаКорень.АналогКоличество 	= СтрокаКорень.АналогКоличество + СтрокаДетальнаяЗапись.АналогКоличество;  
			СтрокаКорень.АналогСумма 		= СтрокаКорень.АналогСумма + СтрокаДетальнаяЗапись.АналогСумма; 
			СтрокаКорень.Экономия 			= СтрокаКорень.Экономия + СтрокаДетальнаяЗапись.Экономия;
			СтрокаКорень.ЭтоКорень 			= Истина;

		КонецЦикла;  
		
		Если СтрокаКорень.ПолучитьЭлементы().Количество() = 0 Тогда
			ЭтотОбъект.ДеревоАналогов.ПолучитьЭлементы().Удалить(СтрокаКорень);
		КонецЕсли;
		 
		
	КонецЦикла;
	
	Возврат 0;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСтрокуДерева(Знач СтрокаДереваТаблицы, Знач Строка)
	
	Строка.КоличествоПотребность 	= СтрокаДереваТаблицы.КоличествоИсходное;  
	//Строка.Цена 					= СтрокаДереваТаблицы.ЦенаИсходная;
	Строка.ЦенаАналог 				= СтрокаДереваТаблицы.Цена;     
	
	//Строка.СуммаПотребность = Строка.КоличествоПотребность * Строка.Цена; 
	Строка.СуммаПотребность 		= Строка.СуммаПотребность;  
	Строка.Цена 					= ?(Строка.КоличествоПотребность = 0 , 0, Строка.СуммаПотребность/Строка.КоличествоПотребность);
	
	Если Строка.Коэффициент = 0 Тогда     
		Строка.АналогКоличество = 0;
	Иначе
		Строка.АналогКоличество = Окр(Строка.КоличествоПотребность * Строка.Коэффициент, 3);      
	КонецЕсли;   
	
	Строка.АналогСумма = Строка.АналогКоличество * Строка.ЦенаАналог;
	
	Если Строка.Цена <> 0 И Строка.ЦенаАналог <> 0 Тогда
		Строка.Экономия = Строка.СуммаПотребность - Строка.АналогСумма;
	Иначе
		Строка.Экономия = 0;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПроверитьКолонкиТаблицы(Знач Таблица, Знач СтрокаКолонок)
	
	Перем ИмяКолонки, ЧастиСтроки, ЧастиСтрокиИтог;
	
	ЧастиСтроки = СтрРазделить(СтрокаКолонок, ", ");        
	ЧастиСтрокиИтог = Новый Массив;      
	Для Каждого ИмяКолонки Из ЧастиСтроки Цикл 
		Если Таблица.Колонки.Найти(ИмяКолонки) <> Неопределено Тогда
			ЧастиСтрокиИтог.Добавить(ИмяКолонки);
		КонецЕсли;
	КонецЦикла;  
	
	Возврат СтрСоединить(ЧастиСтрокиИтог, ", ");

КонецФункции

&НаСервере
Процедура ПеренестиПоляВыбораНаВерхнийУровень(Настройки, ВыборЭлементы, Родитель)
	
	//
	Для Каждого ЭлементВыбора Из ВыборЭлементы Цикл
		Если ТипЗнч(ЭлементВыбора) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			ПеренестиПоляВыбораНаВерхнийУровень(Настройки, ЭлементВыбора.Элементы, ЭлементВыбора);
		ИначеЕсли ТипЗнч(ЭлементВыбора) = Тип("ВыбранноеПолеКомпоновкиДанных") И Родитель <> неопределено Тогда
			Поле = Настройки.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(Поле, ЭлементВыбора,,"Родитель")
		КонецЕсли;
	КонецЦикла;
	
	
	Если Родитель = неопределено Тогда
		
		Поз = 0;
		Пока Поз < ВыборЭлементы.Количество() Цикл
			ЭлементВыбора = ВыборЭлементы[Поз];
			Если ТипЗнч(ЭлементВыбора) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда 
				
				ВыборЭлементы.Удалить(ЭлементВыбора);
				
			Иначе
				Поз = Поз + 1;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры  

Процедура УстановитьОбязательныеПоляПотребностей(Выбор)
	
	Обязательные = Новый Структура();
	Обязательные.Вставить("Валюта");
	
	
	Для Каждого КлючЗначение Из Обязательные Цикл
		
		Если НЕ ПолеВыбрано(Выбор.Элементы, Врег(КлючЗначение.Ключ)) Тогда
			НовоеПоле = Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			НовоеПоле.Поле = Новый ПолеКомпоновкиДанных(КлючЗначение.Ключ);
			НовоеПоле.Использование = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПолеВыбрано(Элементы, ИмяПоля)
	
	Результат = Ложь;
	Для Каждого Элемент Из Элементы Цикл
	
		Если ТипЗнч(Элемент) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда
			Результат = ПолеВыбрано(Элемент.Элементы, ИмяПоля);
		Иначе
			Результат = ИмяПоля = ВРег(Строка(Элемент.Поле));
		КонецЕсли;
	
		Если Результат Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла; 
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура Сформировать(Команда)
	
	ЗаполнитьДеревоНаСервере(Объект.Пользователь, Объект.ПериодЗакупки);  
	УстановитьОтборПоСумме();
	УстановитьОтборПоКлассу(); 
	
	Для Каждого СтрокаДерева Из ДеревоАналогов.ПолучитьЭлементы() Цикл  
		Если Не ЭтотОбъект.Элементы.ДеревоАналогов.Развернут(СтрокаДерева.ПолучитьИдентификатор()) Тогда
			ЭтотОбъект.Элементы.ДеревоАналогов.Развернуть(СтрокаДерева.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимФормированияПриИзменении(Элемент)
	Сформировать(неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ПроизвестиВыборАналога(ИдентификаторСтроки)
	
	ТекущиеДанные = Элементы.ТаблицаАналогов.ТекущиеДанные;
	Если ТекущиеДанные = неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИменаПараметров = "Номенклатура, Характеристика, ЕдиницаИзмерения, АналогНоменклатура, АналогХарактеристика, АналогЕдиницаИзмерения, Классификация, ЕстьАналоги, КоличествоПотребность, СуммаПотребность, Экономия, АналогКоличество, АналогСумма, Автор, ПериодЗакупки";
	ДопПараметры = Новый Структура(ИменаПараметров);
	ЗаполнитьЗначенияСвойств(ДопПараметры, ТекущиеДанные);
	ДопПараметры.Вставить("Автор", 			Объект.Пользователь);
	ДопПараметры.Вставить("ПериодЗакупки", 	Объект.ПериодЗакупки); 
	ДопПараметры.Вставить("ТекущиеДанные", 	ТекущиеДанные);
	ДопПараметры.Вставить("ИменаПараметров", ИменаПараметров);	
	
	ДополнительныеДействия = Новый СписокЗначений;
	Если ТекущиеДанные.ЕстьАналоги Тогда
		ДополнительныеДействия.Добавить("УстановитьАналог", НСтр("ru = 'Установить аналог'"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.АналогНоменклатура) Тогда
		ДополнительныеДействия.Добавить("ОчиститьАналог", НСтр("ru = 'Сбросить аналог'"));
	КонецЕсли;
	
	Если ДополнительныеДействия.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьВыборИзСписка(
		Новый ОписаниеОповещения("ВыборДействияЗавершение", ЭтаФорма, ДопПараметры),
		ДополнительныеДействия, 
		Элементы.ТаблицаАналоговАналогНоменклатура);
	
КонецПроцедуры  
	
&НаКлиенте
Процедура ПроизвестиВыборАналогаДерево(ИдентификаторСтроки)
	
	ТекущиеДанные = Элементы.ДеревоАналогов.ТекущиеДанные;
	Если ТекущиеДанные = неопределено Или Не ТекущиеДанные.ЕстьАналоги Тогда
		Возврат;
	КонецЕсли;
	
	ИменаПараметров = "Номенклатура, Характеристика, ЕдиницаИзмерения, АналогНоменклатура, АналогХарактеристика, АналогЕдиницаИзмерения, Классификация, ЕстьАналоги, КоличествоПотребность, СуммаПотребность, Экономия, АналогКоличество, АналогСумма, Автор, ПериодЗакупки, Валюта";
	ДопПараметры = Новый Структура(ИменаПараметров);
	ЗаполнитьЗначенияСвойств(ДопПараметры, ТекущиеДанные);
	ДопПараметры.Вставить("Автор", 			Объект.Пользователь);
	ДопПараметры.Вставить("ПериодЗакупки", 	Объект.ПериодЗакупки); 
	ДопПараметры.Вставить("ТекущиеДанные", 	ТекущиеДанные);
	ДопПараметры.Вставить("ИменаПараметров", ИменаПараметров);	
	
	ДополнительныеДействия = Новый СписокЗначений;
	Если ТекущиеДанные.ЕстьАналоги Тогда
		ДополнительныеДействия.Добавить("УстановитьАналог", НСтр("ru = 'Установить аналог'"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.АналогНоменклатура) Тогда
		ДополнительныеДействия.Добавить("ОчиститьАналог", НСтр("ru = 'Сбросить аналог'"));
	КонецЕсли;
	
	Если ДополнительныеДействия.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьВыборИзСписка(
		Новый ОписаниеОповещения("ВыборДействияЗавершение", ЭтаФорма, ДопПараметры),
		ДополнительныеДействия, 
		Элементы.ДеревоАналогов);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыборДействияЗавершение(Результат, ДопПараметры) экспорт
	
	Если Результат = неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Значение = "УстановитьАналог" Тогда
		ВыбратьАналог(ДопПараметры);
	ИначеЕсли Результат.Значение = "ОчиститьАналог" Тогда  
		ДополнительныеПараметры = Новый Структура(ДопПараметры.ИменаПараметров);
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, ДопПараметры);
		ОчиститьАналог(ДополнительныеПараметры);
		ОбновитьТаблицуАналогов(, ДопПараметры); 
		Сформировать(Неопределено);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОчиститьАналог(ДопПараметры)
	
	нз = РегистрыСведений.АналогиНоменклатуры.СоздатьНаборЗаписей();
	нз.Отбор.Автор.Установить(ДопПараметры.Автор);
	нз.Отбор.ПериодЗакупки.Установить(ДопПараметры.ПериодЗакупки);
	нз.Отбор.Номенклатура.Установить(ДопПараметры.Номенклатура);
	нз.Отбор.ЕдиницаИзмерения.Установить(ДопПараметры.ЕдиницаИзмерения); 
	нз.Отбор.Валюта.Установить(ДопПараметры.Валюта);
	Если ДопПараметры.Свойство("Характеристика") Тогда
		нз.Отбор.Характеристика.Установить(ДопПараметры.Характеристика);
	Иначе
		нз.Отбор.Характеристика.Установить(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	КонецЕсли;
	нз.Прочитать();
	нз.Очистить();
	нз.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьАналог(ДопПараметры)
	
	ДополнительныеПараметры = Новый Структура(ДопПараметры.ИменаПараметров);
	ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, ДопПараметры);
	ПараметрыФормы = Новый Структура("СтрокаРасшифровки", Новый Структура("Поля", ДополнительныеПараметры));  
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	//
	Завершение = Новый ОписаниеОповещения("ВыборАналогаЗавершение", ЭтаФорма, ДопПараметры);
	
	ОткрытьФорму("РегистрСведений.НастройкаЗаменыНоменклатурыЗакупок.Форма.ФормаВыбораАналога", ПараметрыФормы, ,,,,Завершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборАналогаЗавершение(Результат, ДополнительныеПараметры) экспорт
	
	Если Результат =  неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаписи =  Новый Структура(ДополнительныеПараметры.ИменаПараметров);
	ЗаполнитьЗначенияСвойств(ПараметрыЗаписи, ДополнительныеПараметры);
	
	УстановленныйАналог = ЗаписатьВыборАналогаНаСервере(Результат, ПараметрыЗаписи);
	ОбновитьТаблицуАналогов(УстановленныйАналог, ДополнительныеПараметры);  
	
	Сформировать(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуАналогов(УстановленныйАналог = неопределено, ДополнительныеПараметры = Неопределено)
	
	// Расчет текущей строки       
	Если ДополнительныеПараметры = Неопределено Тогда
		ТД = Элементы.ТаблицаАналогов.ТекущиеДанные;
	Иначе
		ТД = ДополнительныеПараметры.ТекущиеДанные;
	КонецЕсли;
	
	Если УстановленныйАналог = неопределено Тогда
		УстановленныйАналог = Новый Структура("Коэффициент, Цена, АналогНоменклатура, АналогХарактеристика, АналогЕдиницаИзмерения", 0, 0);
		ТД.АналогНоменклатура = Неопределено;
		ТД.АналогХарактеристика = Неопределено;
		ТД.АналогЕдиницаИзмерения = Неопределено;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(ТД, УстановленныйАналог, "АналогНоменклатура, АналогХарактеристика, АналогЕдиницаИзмерения");
	
	ТД.АналогКоличество = Окр(ТД.КоличествоПотребность * УстановленныйАналог.Коэффициент, 3);
	ТД.АналогСумма = ТД.АналогКоличество * УстановленныйАналог.Цена;
	
	Если УстановленныйАналог.Цена <> 0 Тогда
		ТД.Экономия = ТД.АналогСумма - ТД.СуммаПотребность;
	Иначе
		ТД.Экономия = 0;
	КонецЕсли;       
	
	Элементы.ТаблицаАналогов.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаписатьВыборАналогаНаСервере(Результат, ДопПараметры)
	
	//                                                                   
	ПараметрыСреза = Новый Структура("СпособЗамены, НоменклатураИсточник, ХарактеристикаИсточник, ЕдиницаИзмеренияИсточник, НоменклатураПриемник, ХарактеристикаПриемник, ЕдиницаИзмеренияПриемник");
	ЗаполнитьЗначенияСвойств(ПараметрыСреза, Результат);
	Срез = РегистрыСведений.НастройкаЗаменыНоменклатурыЗакупок.СрезПоследних(, ПараметрыСреза);//СоздатьМенеджерЗаписи();   
	мз = Срез[0];
	//ЗаполнитьЗначенияСвойств(мз, Результат);
	//мз.Прочитать();  
	
	// Заполнение результата
	ИменаРеквизитов = "Автор, ПериодЗакупки,Номенклатура,Характеристика,ЕдиницаИзмерения,АналогНоменклатура,АналогХарактеристика,АналогЕдиницаИзмерения,Коэффициент, Валюта";
	УстановленныйАналог = Новый Структура(ИменаРеквизитов);
	
	УстановленныйАналог.Автор = ДопПараметры.Автор;
	УстановленныйАналог.ПериодЗакупки = ДопПараметры.ПериодЗакупки;
	УстановленныйАналог.Номенклатура = ДопПараметры.Номенклатура;
	Если ДопПараметры.Свойство("Характеристика") Тогда
		УстановленныйАналог.Характеристика = ДопПараметры.Характеристика;
	Иначе
		УстановленныйАналог.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли;
	УстановленныйАналог.ЕдиницаИзмерения = ДопПараметры.ЕдиницаИзмерения;
	УстановленныйАналог.АналогНоменклатура = Результат.НоменклатураПриемник;
	УстановленныйАналог.АналогХарактеристика = Результат.ХарактеристикаПриемник;
	УстановленныйАналог.АналогЕдиницаИзмерения = Результат.ЕдиницаИзмеренияПриемник;
	УстановленныйАналог.Коэффициент = мз.Коэффициент;      
	УстановленныйАналог.Валюта = ДопПараметры.Валюта;
	
	УстановленныйАналог.Вставить("Цена", ПолучитьЦенуЗакупки(УстановленныйАналог, ДопПараметры));   
	
	//
	нз = РегистрыСведений.АналогиНоменклатуры.СоздатьНаборЗаписей();      
	
	нз.Отбор.Автор.Установить(ДопПараметры.Автор);
	нз.Отбор.ПериодЗакупки.Установить(ДопПараметры.ПериодЗакупки);
	нз.Отбор.Номенклатура.Установить(ДопПараметры.Номенклатура);
	нз.Отбор.ЕдиницаИзмерения.Установить(ДопПараметры.ЕдиницаИзмерения);    
	нз.Отбор.Валюта.Установить(ДопПараметры.Валюта);
	
	Если ДопПараметры.Свойство("Характеристика") Тогда
		нз.Отбор.Характеристика.Установить(ДопПараметры.Характеристика);
	Иначе
		нз.Отбор.Характеристика.Установить(Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка());
	КонецЕсли;
	нз.Прочитать();
	нз.Очистить();
	ЗаполнитьЗначенияСвойств(нз.Добавить(), УстановленныйАналог);
	нз.Записать(Истина);
	
	Возврат УстановленныйАналог;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьЦенуЗакупки(УстановленныйАналог, ДопПараметры)    
	
	Результат = УправлениеЗакупкамиВстраиваниеПереопределяемыйУХ.ПолучитьЦенуНоменклатуры(УстановленныйАналог.АналогНоменклатура, 
																				УстановленныйАналог.АналогХарактеристика, 
																				Константы.ТипЦенДляРасценкиЗаявокНаПотребность.Получить(),
																				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УстановленныйАналог.ПериодЗакупки, "ДатаОкончания"),
																				ДопПараметры.Валюта);
																				
	Возврат Результат;
		
КонецФункции

&НаКлиенте
Процедура СуммаНеМенееПриИзменении(Элемент)
	
	УстановитьОтборПоСумме(); 
	Сформировать(Неопределено);
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьОтборПоСумме()
	
	Если Объект.СуммаНеМенее = 0 Тогда
		СброситьОтборСтрок("СуммаСоответствуетОтбору");
	Иначе
		// Установить признак
		Для Каждого Строка Из Объект.ТаблицаАналогов Цикл
			Строка.СуммаСоответствуетОтбору = Объект.СуммаНеМенее <= Строка.СуммаПотребность;
		КонецЦикла;
		УстановтьОтборСтрок("СуммаСоответствуетОтбору", Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановтьОтборСтрок(ИмяОтбора, ЗначениеОтбора)
	
	Если Элементы.ТаблицаАналогов.ОтборСтрок = неопределено Тогда
		ОтборСтрок = Новый Структура;
	Иначе
		ОтборСтрок = Новый Структура(Элементы.ТаблицаАналогов.ОтборСтрок);
	КонецЕсли;
	
	ОтборСтрок.Вставить(ИмяОтбора, ЗначениеОтбора);
	
	Элементы.ТаблицаАналогов.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьОтборСтрок(ИмяОтбора)
	
	Если Элементы.ТаблицаАналогов.ОтборСтрок = неопределено 
		ИЛИ НЕ Элементы.ТаблицаАналогов.ОтборСтрок.Свойство(ИмяОтбора) Тогда
		Возврат;
	КонецЕсли;
	
	//
	ОтборСтрок = Новый Структура(Элементы.ТаблицаАналогов.ОтборСтрок);
	ОтборСтрок.Удалить(ИмяОтбора);
	Элементы.ТаблицаАналогов.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура КлассAПриИзменении(Элемент)
	
	УстановитьОтборПоКлассу(); 
	Сформировать(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КлассBПриИзменении(Элемент)
	
	УстановитьОтборПоКлассу();
	Сформировать(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура КлассCПриИзменении(Элемент)
	
	УстановитьОтборПоКлассу();   
	Сформировать(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоКлассу()
	
	СписокКлассов = Новый Структура("A, B, C", Объект.КлассA, Объект.КлассB, Объект.КлассC);
	СтруктураПоиска = Новый Структура("ABC");
	
	Для Каждого КлючЗначение Из СписокКлассов Цикл
		СтруктураПоиска.ABC = КлючЗначение.Ключ;
		Строки = Объект.ТаблицаАналогов.НайтиСтроки(СтруктураПоиска);
		ЗначениеОтбора = КлючЗначение.Значение;
		Для Каждого Строка Из Строки Цикл
			Строка.КлассСоответствуетОтбору = КлючЗначение.Значение;
		КонецЦикла;
	КонецЦикла;
	
	УстановтьОтборСтрок("КлассСоответствуетОтбору", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ПереформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ПериодЗакупкиПриИзменении(Элемент)
	ПереформироватьОтчет();
КонецПроцедуры

&НаКлиенте
Процедура ПереформироватьОтчет()
	ЗаполнитьДеревоНаСервере(Объект.Пользователь, Объект.ПериодЗакупки);
КонецПроцедуры

&НаКлиенте
Процедура ТолькоСАналогамиПриИзменении(Элемент)
	ОтборТолькоСАналогами();
	Сформировать(Неопределено);
КонецПроцедуры  

&НаКлиенте
Процедура ТолькоСЭкономиейПриИзменении(Элемент)
	Сформировать(Неопределено);
КонецПроцедуры

&НаСервере
Функция СтруктураПараметровОтбора(Знач РеквизитыОтбора = "")  
	
	Если РеквизитыОтбора = "" Тогда    
		РеквизитыОтбора = ЭтотОбъект.ТаблицаПараметровОтбора.Выгрузить(, "ИмяРеквизита");  
		РеквизитыОтбора.Свернуть("ИмяРеквизита");
		Реквизиты = РеквизитыОтбора.ВыгрузитьКолонку("ИмяРеквизита");
		РеквизитыОтбора = СтрСоединить(Реквизиты, ",");
	КонецЕсли;      
	
	
	
	РеквизитыКоллекия = СтрРазделить(СтрЗаменить(РеквизитыОтбора, " ", ""), ",", Ложь);    
	Отборы = Новый Структура();
	Для Каждого ИмяРеквизита Из РеквизитыКоллекия Цикл
		СтрокиОтбора = ТаблицаПараметровОтбора.НайтиСтроки(Новый Структура("ИмяРеквизита", ИмяРеквизита));
		Если СтрокиОтбора.Количество() Тогда    
			Отборы.Вставить(ИмяРеквизита, Новый Структура("ВидСравнения, Значение", "ВСписке", Новый СписокЗначений));
			Для Каждого СтрокаОтбора Из СтрокиОтбора Цикл   
				Отборы[ИмяРеквизита].Значение.Добавить(СтрокаОтбора.ЗначениеОтбора);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Отборы;

КонецФункции

&НаКлиенте
Процедура ДеревоАналоговВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "ДеревоАналоговАналогНоменклатура" Тогда
		ПроизвестиВыборАналогаДерево(ВыбраннаяСтрока);
		Сформировать(Неопределено);
	КонецЕсли;

КонецПроцедуры
